//window.onload=function(){
//    window.onresize =function(){
//        if(document.getElementById("adTgshds").offsetLeft-document.getElementById("mk_type").offsetLeft<396) {
//            document.getElementById("adTgshds").style.visibility="hidden";
//        }else{
//            document.getElementById("adTgshds").style.visibility="visible";
//        }
//    };
//};
SeoGa();
function _doZoom(t){
    setCookie(fontCookieName,h,9999);
    var a=document.getElementsByTagName("dl");
    var k=[],c=[],g=[];
    var b=a.length;
    for(var f=0;f<b;f++){
        if(a[f].getElementsByTagName("span").length>0){
            g.push(a[f]);k.push(a[f].getElementsByTagName("span")[0]);
            c.push(a[f].getElementsByTagName("span")[1])
        }
    }
    b=g.length;
    var e=document.getElementById("combinationsContainer");
    switch(parseInt(h)){
        case 0:e.style.fontSize="14px";
            for(var d=0;d<b;d++){
                k[d].className="at";c[d].className=""
            }break;
        case 1:e.style.fontSize="12px";
            for(var d=0;d<b;d++){k[d].className="";c[d].className="at"
            }break
    }
}
Date.prototype.format = function (part) {
    var date = this, redate;
    part = (part == null) ? "yyyy-MM-dd HH:mm:ss" : part;
    var y = date.getFullYear(),
        M = date.getMonth() + 1,
        d = date.getDate(),
        H = date.getHours(),
        m = date.getMinutes(),
        s = date.getSeconds(),
        ms = date.getMilliseconds(),
        CW = "<font class=\"ssp\">"+["周日", "周一", "周二", "周三", "周四", "周五", "周六"][date.getDay()]+"</font>",
        MM = (M > 9) ? M : "0" + M,
        dd = (d > 9) ? d : "0" + d,
        HH = (H > 9) ? H : "0" + H,
        mm = (m > 9) ? m : "0" + m,
        ss = (s > 9) ? s : "0" + s;
    ms = (ms > 9) ? (ms > 99) ? ms : "0" + ms : "00" + ms,
        redate = part.replace("yyyy", y).replace("MM", MM).replace("dd", dd)
            .replace("HH", HH).replace("mm", mm)
            .replace("ms", ms).replace("ss", ss)
            .replace("M", M).replace("d", d)
            .replace("m", m).replace("s", s)
            .replace("CW", CW).replace("H", H);
    return redate;
}
var rows = "";
function setColor0(sender) {
    if (sender.tagName == "TD") {
        for (var i = 0; i < rows.length; i++) {
            rows[i].cells[sender.cellIndex].className=rows[i].cells[sender.cellIndex].className.replace(" at","");
            //rows[i].cells[sender.cellIndex].style.backgroundColor = rows[i].cells[sender.cellIndex].attributes["yc"].nodeValue;
        }
    }
}
function setColor1(sender) {
    if (sender.tagName == "TD") {
        for (var i = 0; i < rows.length; i++) {
            rows[i].cells[sender.cellIndex].className+=" at";
            //rows[i].cells[sender.cellIndex].setAttribute("yc", rows[i].cells[sender.cellIndex].style.backgroundColor);
            //rows[i].cells[sender.cellIndex].style.backgroundColor = "#DEF0F6";
        }
    }
}
function lcolor() {
    rows = document.getElementById("dt_1").rows;
    tiny.addEvent(tiny.selector("dt_1"), "mouseover", function (e) {
        setColor1(e.srcElement || e.target);
    });
    tiny.addEvent(tiny.selector("dt_1"), "mouseout", function (e) {
        setColor0(e.srcElement || e.target);
    });
}
function GetTiShi(p1,p2,p3,pe1/*m*/,pe2/*n*/,pe3,peh/*x*/,name)
{
    var res='';
    var tiShiBase=['提示：&#10;1、{0}如不出现超23倍发行市盈率，预估发行价为预一价格{1}元。&#10;2、{0}如按当前募资总额与新股发行数募集满额，将会出现超23倍发行市盈率，预估发行价为预二价格{2}元。仅供参考！'
        ,'提示：&#10;1、{0}如不出现超行业市盈率发行，预估发行价为预一价格{1}元，预一价格会随行业市盈率变化。&#10;2、{0}如按当前募资总额与新股发行数募集满额，将会出现超行业市盈率发行，预估发行价为预二价格{2}元。仅供参考！'
        ,'提示：&#10;1、{0}如不出现超行业市盈率发行，预估发行价为预一价格{1}元，预一价格会随行业市盈率变化。&#10;2、{0}如按当前募资总额与新股发行数募集满额，将会出现超行业市盈率发行，预估发行价为预二价格{2}元。&#10;3、城地股份如果以计划募集资金发行的话，发行市盈率会超过23倍。针对这种情况，就会出现预三价格{3}元，对应的发行市盈率是22.99，仅供参考！'];
    if(pe1<pe2&&pe2<peh)
        res=tiShiBase[0].format(name,p1,p2);
    else
        res=tiShiBase[1].format(name,p1,p2);
    if(pe2>peh&&pe2>23&&pe1!=pe3)
        res=tiShiBase[2].format(name,p1,p2,p3);
    return res;
}
function GetPAndPe(p1,p2,p3,pe1,pe2,pe3,peh,name,issgh)
{
    //该方法参照1020需求创建
    //var tishi= GetTiShi(data[34],data[47],data[50],data[44],data[48],data[51],hysyl,data[3]);
    var idTwo=false;
    var res=["",""];
    var fxj_x='';
    var syl_x='';
    var tishi= GetTiShi(p1,p2,p3,pe1,pe2,pe3,peh,name);
    var top23=true;
    if(pe2<=peh)
    {
        //pe2小于等于peh就没有预3
        if(pe2>=23)
        {
            top23=false;
            fxj_x = ((isNaN(p1)||!issgh)?'':'<p><img class="Vertical" src="/images/xg_yugu'+(idTwo?"":"1")+'.png" title="黑色斜体部分为预估值，预估值会因为募集资金、发行数量、发行费用等数据变动而变动，仅供参考。" /><font  class="ssp1 Vertical" style="font-style:italic;">&nbsp;'+(p1/1).toFixed(2)+'</font>&nbsp;<i style="width: 14px;display: inline-block;"></i></p>'+((idTwo)?'':'<p><img class="Vertical" src="/images/xg_yugu'+(idTwo?"":"2")+'.png" title="黑色斜体部分为预估值，预估值会因为募集资金、发行数量、发行费用等数据变动而变动，仅供参考。" /><font  class="ssp1 Vertical" style="font-style:italic;">&nbsp;'+(p2/1).toFixed(2)+'</font>'+(top23?'&nbsp;<i style="width: 14px;display: inline-block;"></i>':'&nbsp;<img class="Vertical" src="/images/B3DB94.png" title="'+tishi+'"/>')+'</p>'));
            syl_x=((isNaN(pe1)||!issgh)?'&nbsp;':('<p><img src="/images/xg_yugu1.png" title="黑色斜体部分为预估值，发行市盈率的预估不涉及公司基本面分析，请谨慎参考。" /><font  class="ssp1" style="font-style:italic;">&nbsp;'+(pe1/1).toFixed(2)+'</font></p><p><img src="/images/xg_yugu2.png" title="黑色斜体部分为预估值，发行市盈率的预估不涉及公司基本面分析，请谨慎参考。" /><font  class="ssp1" style="font-style:italic;">&nbsp;'+(pe2/1).toFixed(2)+'</font></p>'));
        }
        else
        {
            //1.1
            fxj_x = ((isNaN(p1)||!issgh)?'':'<p><img class="Vertical" src="/images/xg_yugu'+(idTwo?"":"1")+'.png" title="黑色斜体部分为预估值，预估值会因为募集资金、发行数量、发行费用等数据变动而变动，仅供参考。" /><font  class="ssp1 Vertical" style="font-style:italic;">&nbsp;'+(p1/1).toFixed(2)+'</font>&nbsp;<i style="width: 14px;display: inline-block;"></i></p>'+((idTwo)?'':'<p><img class="Vertical" src="/images/xg_yugu'+(idTwo?"":"2")+'.png" title="黑色斜体部分为预估值，预估值会因为募集资金、发行数量、发行费用等数据变动而变动，仅供参考。" /><font  class="ssp1 Vertical" style="font-style:italic;">&nbsp;'+(p2/1).toFixed(2)+'</font>'+(top23?'&nbsp;<i style="width: 14px;display: inline-block;"></i>':'&nbsp;<img class="Vertical" src="/images/B3DB94.png" title="'+tishi+'"/>')+'</p>'));
            syl_x=((isNaN(pe1)||!issgh)?'&nbsp;':('<p><img src="/images/xg_yugu1.png" title="黑色斜体部分为预估值，发行市盈率的预估不涉及公司基本面分析，请谨慎参考。" /><font  class="ssp1" style="font-style:italic;">&nbsp;'+(pe1/1).toFixed(2)+'</font></p><p><img src="/images/xg_yugu2.png" title="黑色斜体部分为预估值，发行市盈率的预估不涉及公司基本面分析，请谨慎参考。" /><font  class="ssp1" style="font-style:italic;">&nbsp;'+(pe2/1).toFixed(2)+'</font></p>'));
        }
    }
    else
    {
        //pe2小于等于peh可能有预3
        if(pe2>=23)
        {
            //2.2
            //pe2大于等于23就有预3
            //top23==true pe2处不显示提示语
            fxj_x = ((isNaN(p1)||!issgh)?'':'<p><img class="Vertical" src="/images/xg_yugu'+(idTwo?"":"1")+'.png" title="黑色斜体部分为预估值，预估值会因为募集资金、发行数量、发行费用等数据变动而变动，仅供参考。" /><font  class="ssp1 Vertical" style="font-style:italic;">&nbsp;'+(p1/1).toFixed(2)+'</font>&nbsp;<i style="width: 14px;display: inline-block;"></i></p>'+((idTwo)?'':'<p><img class="Vertical" src="/images/xg_yugu'+(idTwo?"":"2")+'.png" title="黑色斜体部分为预估值，预估值会因为募集资金、发行数量、发行费用等数据变动而变动，仅供参考。" /><font  class="ssp1 Vertical" style="font-style:italic;">&nbsp;'+(p2/1).toFixed(2)+'</font>'+(top23?'&nbsp;<i style="width: 14px;display: inline-block;"></i>':'&nbsp;<img class="Vertical" src="/images/B3DB94.png" title="'+tishi+'"/>')+'</p>'));
            syl_x=((isNaN(pe1)||!issgh)?'&nbsp;':('<p><img src="/images/xg_yugu1.png" title="黑色斜体部分为预估值，发行市盈率的预估不涉及公司基本面分析，请谨慎参考。" /><font  class="ssp1" style="font-style:italic;">&nbsp;'+(pe1/1).toFixed(2)+'</font></p><p><img src="/images/xg_yugu2.png" title="黑色斜体部分为预估值，发行市盈率的预估不涉及公司基本面分析，请谨慎参考。" /><font  class="ssp1" style="font-style:italic;">&nbsp;'+(pe2/1).toFixed(2)+'</font></p>'));
            if(p1!=p3)
            {
                fxj_x += '<p><img class="Vertical" src="/images/xg_yugu3.png" title="黑色斜体部分为预估值，预估值会因为募集资金、发行数量、发行费用等数据变动而变动，仅供参考。"><font class="ssp1 Vertical" style="font-style:italic;">&nbsp;'+(p3/1).toFixed(2)+'</font>&nbsp;<img class="Vertical" src="/images/B3DB94.png" title="'+tishi+'"/></p>';
                syl_x+='<p><img src="/images/xg_yugu3.png" title="黑色斜体部分为预估值，发行市盈率的预估不涉及公司基本面分析，请谨慎参考。"><font class="ssp1" style="font-style:italic;">&nbsp;'+(pe3/1).toFixed(2)+'</font></p>';
            }
        }
        else
        {
            top23=false;
            fxj_x = ((isNaN(p1)||!issgh)?'':'<p><img class="Vertical" src="/images/xg_yugu'+(idTwo?"":"1")+'.png" title="黑色斜体部分为预估值，预估值会因为募集资金、发行数量、发行费用等数据变动而变动，仅供参考。" /><font  class="ssp1 Vertical" style="font-style:italic;">&nbsp;'+(p1/1).toFixed(2)+'</font>&nbsp;<i style="width: 14px;display: inline-block;"></i></p>'+((idTwo)?'':'<p><img class="Vertical" src="/images/xg_yugu'+(idTwo?"":"2")+'.png" title="黑色斜体部分为预估值，预估值会因为募集资金、发行数量、发行费用等数据变动而变动，仅供参考。" /><font  class="ssp1 Vertical" style="font-style:italic;">&nbsp;'+(p2/1).toFixed(2)+'</font>'+(top23?'&nbsp;<i style="width: 14px;display: inline-block;"></i>':'&nbsp;<img class="Vertical" src="/images/B3DB94.png" title="'+tishi+'"/>')+'</p>'));
            syl_x=((isNaN(pe1)||!issgh)?'&nbsp;':('<p><img src="/images/xg_yugu1.png" title="黑色斜体部分为预估值，发行市盈率的预估不涉及公司基本面分析，请谨慎参考。" /><font  class="ssp1" style="font-style:italic;">&nbsp;'+(pe1/1).toFixed(2)+'</font></p><p><img src="/images/xg_yugu2.png" title="黑色斜体部分为预估值，发行市盈率的预估不涉及公司基本面分析，请谨慎参考。" /><font  class="ssp1" style="font-style:italic;">&nbsp;'+(pe2/1).toFixed(2)+'</font></p>'));
        }
    }
    res[0]=fxj_x;
    res[1]=syl_x;
    return res;
}
var tablelist = new LoadTable({
    id: "dt_1",
    sort: { id: "12", desc: true },
    cells: [{ "n": "股票<font class=\"ssp\" style=\"text-decoration: underline;\">代码</font>", "s": "5" },
        { "n": "股票<font class=\"ssp2\">简称</font>", "w": "58" },
        { "n": "相关资料", "w": "120" },
        { "n": "申购<br />代码", "w": "44" },
        { "n": "发行<br />总数<br />(万股)", "s": "7" },
        { "n": "网上<br />发行<br />(万股)", "s": "8" },
        { "n": "顶格申购<br />需配市值<br />(万元)<i title=\"黑色斜体部分为预估值，顶格申购需配市值的预估不涉及公司基本面分析，请谨慎参考。\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</i>" },
        { "n": "申购<br />上限<br />(万股)<i title=\"黑色斜体部分为预估值，申购上限的预估不涉及公司基本面分析，请谨慎参考。\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</i>"},
        //{ "n": "申购资<br />金上限<br />(万元)<i title=\"黑色斜体部分为预估值，申购资金上限的预估不涉及公司基本面分析，请谨慎参考。\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</i>" },
        { "n": "发行<br />价格<br /><i title=\"黑色斜体部分为预估值，发行价的预估不涉及公司基本面分析，请谨慎参考。\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</i>", "s": "11"},
        { "n": "最新价", "s": "24" },
        { "n": "首日<br />收盘价", "s": "25" },
        { "n": "申购日期", "s": "12", "w": "70" },
        { "n": "中签号<br />公布<i title=\"中签号公布之后, 可点击中签号公布日期查询中签号\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</i>", "s": "13" },
        { "n": "中签缴<br />款日期", "s": "33" }, //12
        { "n": "上市<br />日期", "s": "14" },
        { "n": "发行<br />市盈率<i title=\"黑色斜体部分为预估值，发行市盈率的预估不涉及公司基本面分析，请谨慎参考。\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</i>", "s": "15" },
        { "n": "行业<br />市盈率", "s": "28" },
        { "n": "中签率<br />(%)", "s": "16" },
        //16{ "n": "每中<br />一签约<br />(万元)", "s": "19" },
        //17{ "n": "冻结<br />资金<br />(亿元)", "s": "17" },
        { "n": "询价累<br />计报价<br />倍数<i title=\"初步询价阶段累计报价股数除以初步询价阶段网下配售股数\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</i>", "s": "18" },
        { "n": "配售对象<br />报价家数", "s": "29" },
        //20{ "n": "打新<br />收益<br />(%)<i title=\"计算公式：打新收益率=中一签的股数*(上市首个非一字板（上市首日不计）成交均价-发行价)/每中一签需要的资金\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</i>", "s": "32" },
        { "n": "连续<br/>一字板<br />数量<i title=\"上市首日默认一字板\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</i>","s":"31" },
        { "n": "总涨<br />幅%<i title=\"表示新股未开板的浮盈率或已开板的平均出场获利率\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</i>"},
        { "n": "每中一<br/>签获利<br/>(元)<i title=\"表示新股中一签未开板的浮盈或已开板的平均出场获利\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</i>"},
        { "n": "招股说<br />明书/意<br />向书<i title=\"提供最新的招股说明书。如果招股说明书没公布，则提供最新的招股意向书。\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</i>"}
    ],
    dataurl: "http://datainterface.eastmoney.com/EM_DataCenter/JS.aspx?type=NS&sty=NSSTV5&st={sortType}&sr={sortRule}&p={page}&ps={pageSize}&js=var {jsname}={pages:(pc),data:[(x)]}{param}",
    defjson:{pages:33,data:["AN201707120714024370,33029,80133074,秦港股份,601326,780326,558000000.00,167400000.00,167000.00,390780.00,2.34,2017-08-04,2017-08-08,,49.62,,,1444.30,,sh,1000.00,564143600000.00,1670000.00,,,,http://topic.eastmoney.com/qhdg2012/,公司为客户提供高度一体化的综合港口服务&sbquo;包括装卸、堆存、仓储、运输及物流服务&sbquo;经营货种主要包括煤炭、金属矿石、油品及液体化工、集装箱、杂货及其他货品。,1.08,16.700000,39.080000,2.22,30.86,5073,1.08,16.70,18.04,167.00,待上市,,,,,AN201707040689330879,22.99,30.85,2017-08-08,2.34,49.58,,1.08,22.99",",33184,80476577,勘设股份,603458,732458,31037867.00,12410000.00,12000.00,,,2017-07-28,2017-08-01,,,,,,,sh,1000.00,,120000.00,,,,http://topic.eastmoney.com/GZSJTGHKCSJ/,工程咨询与工程承包业务&sbquo;覆盖公路、市政、建筑、水运等行业,29.36,1.200000,35.250000,,0,,29.36,1.20,35.23,12.00,待上市,,,,,AN201707190730258069,22.98,53.63,2017-08-01,29.36,22.98,,29.36,22.99",",33173,80200644,嘉诚国际,603535,732535,37600000.00,14600000.00,14000.00,,,2017-07-27,2017-07-31,,,,,,,sh,1000.00,,140000.00,,,,http://topic.eastmoney.com/GZSJCGJWLIPO/,为制造业企业提供全程供应链一体化管理的第三方综合物流服务,15.17,1.400000,21.240000,,0,,15.17,1.40,21.24,14.00,待上市,,,,,AN201707180727296519,22.85,40.79,2017-07-31,15.17,22.85,,15.26,22.99",",33175,80026898,海特生物,300683,300683,25838760.00,10238760.00,10000.00,,,2017-07-27,2017-07-31,,,,,,,cyb,500.00,,100000.00,,,,http://topic.eastmoney.com/WHHTSWZYIPO/,生物制品(注射用鼠神经生长因子冻干粉针剂、注射用抗乙肝转移因子冻干粉针剂)、凝血酶和其他化学药品的研发、生产和销售。,32.94,1.000000,32.950000,,0,,32.94,1,32.94,10.00,待上市,,,,,AN201707180727344131,22.98,38.26,2017-07-31,32.94,22.98,,32.96,22.99",",33153,80463405,南卫股份,603880,732880,25000000.00,10000000.00,10000.00,,,2017-07-26,2017-07-28,,,,,,,sh,1000.00,,100000.00,,,,http://topic.eastmoney.com/JSNFWCYYIPO/,从事透皮产品、医用胶布胶带及绷带、运动保护产品、急救包、护理产品等产品的研发、生产和销售。,11.72,1.000000,11.720000,,0,,11.72,1,11.72,10.00,待上市,,,,,AN201707170725152038,22.98,38.26,2017-07-28,11.72,22.98,,11.72,22.99",",33141,80394350,智动力,300686,300686,31300000.00,12300000.00,12000.00,,,2017-07-26,2017-07-28,,,,,,,cyb,500.00,,120000.00,,,,http://topic.eastmoney.com/ZDLJMJSIPO/,为手机等消费电子功能性器件的研发、生产和销售&sbquo;为客户提供功能性器件的设计、生产、检测等全方位服务,9.39,1.200000,11.270000,,0,,9.39,1.20,11.27,12.00,待上市,,,,,AN201707160724472674,20.98,47.32,2017-07-28,9.39,20.98,,10.28,22.99","AN201707200733237591,33195,80116152,赛意信息,300687,300687,20000000.00,20000000.00,,,22.14,2017-07-25,2017-07-27,,22.99,,,,,cyb,500.00,,,,,,http://topic.eastmoney.com/GZSYXXIPO/,专注于面向制造、零售、服务等行业领域的集团及大中型客户提供完整的信息化解决方案及服务,22.14,2.000000,44.280000,,0,,22.14,2,44.28,20.00,待上市,,,,,,22.99,50.77,2017-07-27,22.14,22.99,,22.13,22.99","AN201707190730292834,33186,80468960,艾德生物,300685,300685,20000000.00,20000000.00,20000.00,277200.00,13.86,2017-07-24,2017-07-26,,22.99,,,,,cyb,500.00,,200000.00,,,,http://topic.eastmoney.com/XMADSWYYIPO/,肿瘤精准医疗分子诊断产品的研发、生产及销售&sbquo;并提供相关的检测服务,13.86,2.000000,27.720000,,38.32,,13.86,2,27.72,20.00,待上市,,,,,,22.99,38.32,2017-07-26,13.86,22.99,,13.86,22.99","AN201707190730298620,33185,80476572,弘宇股份,002890,002890,16670000.00,16670000.00,16500.00,210540.00,12.76,2017-07-24,2017-07-26,,22.99,,,,,zxb,500.00,,165000.00,,,,http://topic.eastmoney.com/SDHYNJIPO/,拖拉机液压提升器的研发、生产和销售,12.76,1.650000,21.060000,,61.56,,12.76,1.65,21.05,16.50,待上市,,,,,,22.99,61.56,2017-07-26,12.76,22.99,,12.75,22.99","AN201707180727300469,33174,80202029,中公高科,603860,732860,16680000.00,16680000.00,16000.00,249920.00,15.62,2017-07-21,2017-07-25,,22.99,,,,,sh,1000.00,,160000.00,,,,http://topic.eastmoney.com/zggk/,路况快速检测设备研发生产与销售、公路养护信息系统开发与销售、公路养护决策咨询服务,15.62,1.600000,25.000000,,54.02,,15.62,1.60,24.99,16.00,待上市,,,,,,22.98,54.02,2017-07-25,15.62,22.98,,15.62,22.99","AN201707190730258074,33114,80205970,华扬联众,603825,732825,40000000.00,16000000.00,16000.00,234720.00,14.67,2017-07-21,2017-07-25,,22.98,,,542.08,,sh,1000.00,13009800000.00,160000.00,,,,http://topic.eastmoney.com/hylz/,提供互联网及数字媒体领域全方位服务的广告公司&sbquo;并致力于提供跨媒体领域的整合营销服务。,14.67,1.600000,23.480000,14.67,55.28,5132,14.67,1.60,23.47,16.00,待上市,,,,,AN201707120714024372,22.98,55.28,2017-07-25,14.67,22.98,,14.67,22.99","AN201707180727296517,33097,80115571,设计总院,603357,732357,81200000.00,73080000.00,32000.00,334080.00,10.44,2017-07-20,2017-07-24,,17.61,0.0461,,665.67,22629700,sh,1000.00,32431200000.00,320000.00,,,,http://topic.eastmoney.com/GHJTSJIPO/,为公路、水运、市政等领域的工程建设提供勘察设计、咨询研发、试验检测、工程管理等专业工程咨询服务。,10.44,3.200000,33.410000,10.44,54.5,5363,10.44,3.20,33.41,32.00,待上市,,,,,AN201707110711244745,17.61,54.23,2017-07-24,10.44,17.61,,13.62,22.99","AN201707180727344149,33099,80397843,朗新科技,300682,300682,45000000.00,40500000.00,13500.00,74385.00,5.51,2017-07-20,2017-07-24,,22.99,0.0373,,1489.99,7384600,cyb,500.00,46934600000.00,135000.00,,,,http://topic.eastmoney.com/LXKJIPO/,公司是一家专注于公用事业领域业务信息化系统的技术与服务提供商。,5.51,1.350000,7.440000,5.51,51.41,5757,5.51,1.35,7.44,13.50,待上市,,,,,AN201707110711271051,22.99,51.41,2017-07-24,5.51,22.99,,5.51,22.99","AN201706260671196129,32949,80474382,绿茵生态,002887,002887,20000000.00,20000000.00,20000.00,840200.00,42.01,2017-07-20,2017-07-24,,22.98,0.0136,,,154095400,zxb,500.00,,200000.00,,,,http://topic.eastmoney.com/LXJGSTJSIPO/,生态环境建设工程施工&sbquo;主要涉及生态修复工程、市政园林绿化工程、地产景观工程等&sbquo;具体工程业务包括:盐碱地修复、河道治理、湿地保护、荒山及矿山修复;城市道路绿化、广场公园绿化工程;住宅和旅游地产绿化工程等,30.84,2.000000,84.020000,,16.69,,30.84,2,61.68,20.00,待上市,,,,,,16.87,16.87,2017-07-24,42.01,22.98,,42.03,22.99","AN201707170725152035,33085,80468961,大参林,603233,732233,40010000.00,36009000.00,12000.00,296640.00,24.72,2017-07-19,2017-07-21,,22.99,0.0372,,570.80,66454400,sh,1000.00,15986500000.00,120000.00,,,,http://topic.eastmoney.com/DSLIPO/,专注于中西成药、参茸滋补药材及中药饮片、保健品、医疗器械及其他商品的直营连锁零售业务,24.72,1.200000,29.670000,24.72,39.91,5271,24.72,1.20,29.66,12.00,待上市,,,,,AN201707100709191186,22.99,39.91,2017-07-21,24.72,22.99,,24.72,22.99","AN201707170725169525,33087,80504203,电连技术,300679,300679,30000000.00,27000000.00,12000.00,812640.00,67.72,2017-07-19,2017-07-21,,22.99,0.0271,,666.00,124859300,cyb,500.00,11988000000.00,120000.00,,,,http://topic.eastmoney.com/DLJSGFIPO/,专业从事微型电连接器及互连系统相关产品的技术研究、设计、制造和销售服务,67.72,1.200000,81.270000,67.72,47.54,5908,67.72,1.20,81.26,12.00,待上市,,,,,AN201707110709217556,22.99,47.54,2017-07-21,67.72,22.99,,67.72,22.99","AN201706250670547535,32869,80198750,岱美股份,603730,732730,48000000.00,43200000.00,14000.00,348880.00,24.92,2017-07-18,2017-07-20,,22.92,0.0415,,1462.55,60019500,sh,1000.00,49141600000.00,140000.00,,,,http://topic.eastmoney.com/dmqcnsj/,汽车零部件的研发、生产和销售,21.18,1.400000,34.890000,24.8,18.8,4838,21.18,1.40,29.65,14.00,待上市,,,,,AN201706180657290642,19.48,19.48,2017-07-20,24.92,22.92,,24.99,22.99","AN201707160724453677,33073,80463410,禾望电气,603063,732063,60000000.00,54000000.00,18000.00,240480.00,13.36,2017-07-18,2017-07-20,,22.98,0.0453,,632.80,29503500,sh,1000.00,26577800000.00,180000.00,,,,http://topic.eastmoney.com/hwdqipo/,公司专注于电能变换领域&sbquo;帮助客户实现高效、可靠、高品质的发电、用电和电能传输。公司经过多年的研发投入&sbquo;目前形成了以电力电子技术、电气传动技术、工业通信/互联技术和整机工艺/制造工艺技术为核心的技术平台。,13.36,1.800000,24.050000,13.36,29.84,5282,13.36,1.80,24.05,18.00,待上市,,,,,AN201707090708514050,22.98,29.87,2017-07-20,13.36,22.98,,13.36,22.99","AN201707160724474785,33074,80154320,东方嘉盛,002889,002889,34530000.00,31077000.00,13500.00,174690.00,12.94,2017-07-18,2017-07-20,,22.98,0.0267,,1417.13,24214900,zxb,500.00,29360200000.00,135000.00,,,,http://topic.eastmoney.com/dfjsipo/,提供综合供应链管理服务。,12.94,1.350000,17.470000,12.95,32.58,5733,12.94,1.35,17.47,13.50,待上市,,,,,AN201707090708548791,22.98,32.58,2017-07-20,12.94,22.98,,12.94,22.99","AN201707110711274842,33098,80463003,英搏尔,300681,300681,18900000.00,18900000.00,18500.00,323010.00,17.46,2017-07-14,2017-07-18,,22.99,0.0149,,,58536600,cyb,500.00,,185000.00,,,,http://topic.eastmoney.com/ZHYBEDQIPO/,以电机控制器为主&sbquo;车载充电机、DC-DC转换器、电子油门踏板等为辅的电动车辆关键零部件的研发、生产与销售。,17.46,1.850000,32.310000,,29.79,,17.46,1.85,32.30,18.50,待上市,,,,,,22.99,29.79,2017-07-18,17.46,22.99,,17.46,22.99","AN201707100709205823,33086,80121813,隆盛科技,300680,300680,17000000.00,17000000.00,17000.00,147560.00,8.68,2017-07-13,2017-07-17,,19.29,0.0139,,,31302100,cyb,500.00,,170000.00,,,,http://topic.eastmoney.com/WXLSKJIPO/,发动机废气再循环(EGR)系统的研发、生产与销售,8.68,1.700000,14.760000,,19.45,,8.68,1.70,14.76,17.00,待上市,,,,,,19.17,19.45,2017-07-17,8.68,19.17,,10.41,22.99","AN201707110711274860,33028,80410733,中科信息,300678,300678,25000000.00,22500000.00,10000.00,78500.00,7.85,2017-07-13,2017-07-17,,22.99,0.0252,,2629.08,15556800,cyb,500.00,39436200000.00,100000.00,,,,http://topic.eastmoney.com/zkycdxxjsipo/,以智能识别及分析技术为核心&sbquo;为客户提供信息化解决方案(包括软件及硬件)及相关服务&sbquo;目前主要应用在现场会议、印钞检测、烟草、石油、政府及其他领域。,7.85,1.000000,7.850000,7.85,51.63,6500,7.85,1,7.85,10.00,待上市,,,,,AN201707030689219694,22.99,51.71,2017-07-17,7.85,22.99,,7.85,22.99","AN201707100709206913,33012,80495350,N英科,300677,300677,24309827.00,21879000.00,9500.00,193705.00,20.39,2017-07-12,2017-07-14,2017-07-21,22.99,0.0258,,1629.05,39566300,cyb,500.00,23767800000.00,95000.00,29.36,,,http://topic.eastmoney.com/SDYKYLYPIPO/,发行人为综合型医疗护理产品供应商&sbquo;主营业务涵盖医疗防护、康复护理、保健理疗、检查耗材四大板块,20.39,0.950000,19.380000,20.38,38.52,5813,20.39,0.95,19.37,9.50,未开板,,,,,AN201707020687919976,22.99,38.59,2017-07-14,20.39,22.99,,20.39,22.99","AN201707100709207787,33013,80490045,N惠威,002888,002888,20780000.00,18702000.00,8000.00,71760.00,8.97,2017-07-12,2017-07-14,2017-07-21,22.97,0.0222,,2630.98,20187900,zxb,500.00,32887200000.00,80000.00,12.92,,,http://topic.eastmoney.com/GZHWDSKJIPO/,音响设备、扬声器的研发、生产和销售,8.97,0.800000,7.180000,8.97,47.2,6529,8.97,0.80,7.18,8.00,未开板,,,,,AN201707020687912034,22.97,47.30,2017-07-14,8.97,22.97,,8.97,22.99","AN201707090708514053,33010,80601205,N卫信康,603676,732676,63000000.00,56700000.00,18000.00,99540.00,5.53,2017-07-11,2017-07-13,2017-07-21,22.96,0.0471,,1048.19,11749700,sh,1000.00,46225000000.00,180000.00,7.96,,,http://topic.eastmoney.com/XZWXKYYIPO/,以临床需求为导向&sbquo;立足于研发创新&sbquo;坚持仿创结合&sbquo;以化学药品制剂及其原料药的研发、生产、销售为主营业务&sbquo;在静脉维生素补充剂、静脉电解质补充剂、静脉补铁剂等细分领域具有较强竞争力&sbquo;同时生产和销售护肝类用药、抗生素类产品,5.53,1.800000,9.960000,5.54,38.64,5062,5.53,1.80,9.95,18.00,未开板,,,,,AN201707020687876361,22.97,38.64,2017-07-13,5.53,22.97,,5.53,22.99","AN201707060699886855,33011,80476571,嘉泽新能,601619,780619,193712341.00,174342000.00,58000.00,73080.00,1.26,2017-07-10,2017-07-12,2017-07-20,17.87,0.0898,,1703.01,1402600,sh,1000.00,230927000000.00,580000.00,1.99,1.81,0.04,http://topic.eastmoney.com/NXJZXNY/,新能源电力的开发、投资、建设、经营和管理,1.26,5.800000,7.310000,1.26,18.64,4980,1.26,5.80,7.31,58.00,未开板,,,,,AN201707020687876369,17.87,18.64,2017-07-12,1.26,17.87,,1.62,22.99","AN201707050696127734,32963,80198713,健友股份,603707,732707,63500000.00,57150000.00,19000.00,136990.00,7.21,2017-07-07,2017-07-11,2017-07-19,22.98,0.0464,,708.45,15545900,sh,1000.00,31490500000.00,190000.00,12.56,10.38,0.02,http://topic.eastmoney.com/NJJYSHZYIPO/,药品原料、制剂的研发、生产和销售,7.20,1.900000,13.700000,7.35,38.52,5121,7.20,1.90,13.68,19.00,未开板,,,,,AN201706270673067944,22.95,38.53,2017-07-11,7.20,22.95,,7.21,22.99","AN201707040692328131,32964,80198742,索通发展,603612,732612,60200000.00,54180000.00,23000.00,181240.00,7.88,2017-07-06,2017-07-10,2017-07-18,22.97,0.0403,,1105.97,19578500,sh,1000.00,40920800000.00,230000.00,15.11,11.35,0.02,http://topic.eastmoney.com/stfz/,预焙阳极的研发、生产及销售业务,7.88,2.300000,18.130000,7.88,32.48,5067,7.88,2.30,18.12,23.00,未开板,,,,,AN201706270673071979,22.97,32.72,2017-07-10,7.88,22.97,,7.88,22.99","AN201707040689330877,32929,80463420,基蛋生物,603387,732387,33000000.00,29700000.00,13000.00,289250.00,22.25,2017-07-05,2017-07-07,2017-07-17,22.99,0.0292,,1047.89,76099300,sh,1000.00,20748200000.00,130000.00,46.90,32.04,0.01,http://topic.eastmoney.com/JDSWKJIPO/,主要从事体外诊断产品的研发、生产和销售,22.25,1.300000,28.930000,22.25,38.32,4953,22.25,1.30,28.93,13.00,未开板,,,,,AN201706250670548089,22.99,38.39,2017-07-07,22.25,22.99,,22.25,22.99","AN201707030689222765,32948,80473150,华大基因,300676,300676,40100000.00,36090000.00,12000.00,163680.00,13.64,2017-07-05,2017-07-07,2017-07-14,22.99,0.0356,,986.12,19157600,cyb,500.00,27710000000.00,120000.00,31.63,19.64,0.02,http://topic.eastmoney.com/SZHDJYIPO/,通过基因检测等手段&sbquo;为医疗机构、科研机构、企事业单位等提供基因组学类的诊断和研究服务。,13.64,1.200000,16.370000,13.64,53.79,5406,13.64,1.20,16.37,12.00,未开板,,,,,AN201706260671200458,22.99,53.79,2017-07-07,13.64,22.99,,13.63,22.99","AN201707030689219804,32930,80303978,建科院,300675,300675,36666700.00,33000500.00,13500.00,49410.00,3.66,2017-07-05,2017-07-07,2017-07-19,22.96,0.0303,,1489.07,6034400,cyb,500.00,34248500000.00,135000.00,6.38,5.27,0.01,http://topic.eastmoney.com/SZSJZKXYJY/,建筑设计、绿色建筑咨询、生态城市规划、公信服务等业务,3.66,1.350000,4.950000,3.66,53.74,5613,3.66,1.35,4.94,13.50,未开板,,,,,AN201706260670570102,22.96,53.79,2017-07-07,3.66,22.96,,3.66,22.99","AN201706280675438513,32908,80494165,东尼电子,603595,732595,25000000.00,22500000.00,10000.00,130100.00,13.01,2017-06-30,2017-07-04,2017-07-12,22.99,0.0264,,1356.57,49249500,sh,1000.00,20348500000.00,100000.00,36.50,18.73,0.01,http://topic.eastmoney.com/ZJDNDZIPO/,公司专注于超微细合金线材及其他金属基复合材料的应用研发、生产与销售。,13.01,1.000000,13.010000,13.01,46.28,5036,13.01,1,13.01,10.00,未开板,,,,,AN201706210661552357,22.99,46.35,2017-07-04,13.01,22.99,,13.01,22.99","AN201706270673118814,32965,80404270,佩蒂股份,300673,300673,20000000.00,20000000.00,20000.00,446800.00,22.34,2017-06-30,2017-07-04,2017-07-11,22.99,0.0152,,,73350200,cyb,500.00,,200000.00,39.66,32.17,0.01,http://topic.eastmoney.com/PDDWYYKJIPO/,宠物食品的研发、生产和销售,22.34,2.000000,44.680000,,26.64,,22.34,2,44.68,20.00,开板,107.12,4,0.02,2017/7/17 0:00:00,,22.99,26.64,2017-07-04,22.34,22.99,,22.34,22.99","AN201706270673067943,32889,80476575,大元泵业,603757,732757,21000000.00,18900000.00,8000.00,179360.00,22.42,2017-06-29,2017-07-03,2017-07-11,16.30,0.0253,,991.69,88483700,sh,1000.00,12495300000.00,80000.00,42.32,32.28,0.01,http://topic.eastmoney.com/zjdybyipo/,各类泵的研发、生产和销售,22.42,0.800000,17.940000,22.41,39.57,4975,22.42,0.80,17.94,8.00,开板,109.41,4,0.03,2017/7/17 0:00:00,AN201706190657891875,16.30,39.57,2017-07-03,22.42,16.30,,31.61,22.99","AN201706260671196088,32950,80463400,凌霄泵业,002884,002884,19370000.00,19370000.00,19000.00,553090.00,29.11,2017-06-29,2017-07-03,2017-07-11,16.44,0.0138,,,105673000,zxb,500.00,,190000.00,50.53,41.92,0.01,http://topic.eastmoney.com/GDLXBYIPO/,民用离心泵的研发、设计、生产及销售,29.11,1.900000,55.310000,,39.57,,29.11,1.90,55.31,19.00,开板,105.08,4,0.01,2017/7/17 0:00:00,,16.44,39.57,2017-07-03,29.11,16.44,,40.71,22.99","AN201706260671177694,32868,80492225,旭升股份,603305,732305,41600000.00,37440000.00,12000.00,135120.00,11.26,2017-06-28,2017-06-30,2017-07-10,22.98,0.0393,,1075.59,28682000,sh,1000.00,31321200000.00,120000.00,38.21,16.21,0.02,http://topic.eastmoney.com/NBXSQCJSIPO/,公司主要从事压铸成型的精密铝合金汽车零部件和工业零部件的研发、生产、销售&sbquo;产品主要应用于新能源汽车行业及其他机械制造行业。,11.26,1.200000,13.520000,11.26,73.49,5183,11.26,1.20,13.51,12.00,未开板,,,,,AN201706180657290644,22.94,73.72,2017-06-30,11.26,22.94,,11.28,22.99","AN201706260671200463,32890,80498300,国科微,300672,300672,27941167.00,25147500.00,11000.00,93280.00,8.48,2017-06-28,2017-06-30,2017-07-12,22.98,0.0269,,3344.06,15741000,cyb,500.00,56063700000.00,110000.00,23.80,12.21,0.01,http://topic.eastmoney.com/HNGKWDZIPO/,大规模集成电路的设计、研发及销售,8.48,1.100000,9.330000,8.6,45.89,5545,8.48,1.10,9.33,11.00,未开板,,,,,AN201706190657905856,22.98,46.01,2017-06-30,8.48,22.98,,8.48,22.99","AN201706220663732090,32846,80474375,睿能科技,603933,732933,25670000.00,23103000.00,10000.00,202000.00,20.20,2017-06-26,2017-06-28,2017-07-06,22.99,0.0267,,645.37,75697800,sh,1000.00,9940000000.00,100000.00,46.08,29.09,0.01,http://topic.eastmoney.com/FJRNKJIPO/,以针织横机电脑控制系统的研发、生产和销售为主的制造业务及以IC产品分销为主的分销业务,20.20,1.000000,20.200000,20.19,45.77,4921,20.20,1,20.20,10.00,开板,152.23,6,0.04,2017/7/14 0:00:00,AN201706140648104699,22.99,45.84,2017-06-28,20.20,22.99,,20.19,22.99","AN201706210661552424,32845,80439290,百达精工,603331,732331,31813300.00,28632000.00,12000.00,115560.00,9.63,2017-06-23,2017-06-27,2017-07-05,22.98,0.0305,,2451.38,31558400,sh,1000.00,46792600000.00,120000.00,19.71,13.87,0.01,http://topic.eastmoney.com/BDJG/,各类压缩机零部件、汽车零部件的研发、制造和销售业务。,9.63,1.200000,11.560000,9.8,39.53,5777,9.63,1.20,11.56,12.00,开板,161.16,7,0.05,2017/7/14 0:00:00,AN201706140648098768,22.98,39.53,2017-06-27,9.63,22.98,,9.63,22.99","AN201706210661583889,32836,80489140,富满电子,300671,300671,25350000.00,22815000.00,10000.00,81100.00,8.11,2017-06-23,2017-06-27,2017-07-05,22.97,0.0263,,2241.39,15430200,cyb,500.00,34091600000.00,100000.00,24.03,11.68,0.01,http://topic.eastmoney.com/FMDZJTIPO/,本公司是集成电路(Integrated Circuit&sbquo;简称&quot;IC&quot;)设计企业&sbquo;主要从事高性能模拟及数模混合集成电路的设计研发、封装、测试和销售。依托公司的技术研发、业务模式、快速服务和人才储备等优势&sbquo;公司已成为集成电路行业电源管理类芯片、LED控制及驱动类芯片等细分领域的优秀企业。,8.11,1.000000,8.110000,8.11,50.59,5570,8.11,1,8.11,10.00,开板,227.25,9,0.06,2017/7/18 0:00:00,AN201706130645245340,22.97,50.65,2017-06-27,8.11,22.97,,8.11,22.99","AN201706200659508067,32835,80463375,大烨智能,300670,300670,27000000.00,24300000.00,10500.00,114765.00,10.93,2017-06-22,2017-06-26,2017-07-03,22.98,0.0268,,2401.42,20396000,cyb,500.00,38903000000.00,105000.00,22.28,15.74,0.01,http://topic.eastmoney.com/JSDYZNDQIPO/,发行人始终致力于配电网的安全、稳定、自动化和信息化等方面的技术研究、产品开发和生产服务&sbquo;公司产品包括配电自动化终端、智能中压开关设备、变电站自动化系统、低压电气成套设备等,10.93,,,10.93,28.48,5460,10.93,1.05,11.48,10.50,开板,168.80,7,0.05,2017/7/12 0:00:00,AN201706130645245351,22.98,28.52,2017-06-26,10.93,22.98,,10.93,22.99","AN201706190657891868,32809,80282058,君禾股份,603617,732617,25000000.00,22500000.00,10000.00,89300.00,8.93,2017-06-21,2017-06-23,2017-07-03,17.53,0.0263,,1715.51,33942400,sh,1000.00,25732700000.00,100000.00,23.13,12.86,0.01,http://topic.eastmoney.com/JHBYIPO/,专业从事家用水泵及其配件的研发、设计、制造及销售,8.93,,,8.93,39.96,5109,8.93,1,8.93,10.00,开板,204.82,9,0.05,2017/7/14 0:00:00,AN201706110641970488,17.53,39.84,2017-06-23,8.93,17.53,,11.70,22.99","AN201706180657290635,32810,80490044,志邦股份,603801,732801,40000000.00,36000000.00,16000.00,375520.00,23.47,2017-06-20,2017-06-22,2017-06-30,22.92,0.0321,,635.18,73212000,sh,1000.00,15244400000.00,160000.00,42.37,33.80,0.01,http://topic.eastmoney.com/ZBCGIPO/,整体厨柜、定制衣柜等定制家具产品的设计、研发、生产、销售和安装服务。,23.47,,,23.46,44.06,5052,23.47,1.60,37.55,16.00,开板,105.20,4,0.03,2017/7/6 0:00:00,AN201706110641970486,22.92,44.15,2017-06-22,23.47,22.92,,23.54,22.99","AN201706150650529795,32789,80498301,沪宁股份,300669,300669,21050000.00,18945000.00,8000.00,88000.00,11.00,2017-06-19,2017-06-21,2017-06-29,22.96,0.0246,,2419.79,22374500,cyb,500.00,31457300000.00,80000.00,24.97,15.84,0.01,http://topic.eastmoney.com/HZHNDTBJIPO/,电梯部件的开发设计、生产制造和销售,11.00,,,11,40.04,6242,11.00,0.80,8.80,8.00,开板,182.27,8,0.04,2017/7/11 0:00:00,AN201706090634919513,22.96,40.04,2017-06-21,11.00,22.96,,11.01,22.99","AN201706140648104698,32778,80463402,三孚股份,603938,732938,37556600.00,33801000.00,14000.00,134960.00,9.64,2017-06-16,2017-06-20,2017-06-28,22.99,0.0325,,1027.14,29676900,sh,1000.00,23624800000.00,140000.00,24.15,13.88,0.01,http://topic.eastmoney.com/TSSFGYIPO/,主要从事三氯氢硅及氢氧化钾等精细化工产品的研发、生产和销售。,9.63,,,9.64,39.78,5114,9.63,1.40,13.48,14.00,开板,202.18,8,0.07,2017/7/10 0:00:00,AN201706070632168085,22.97,39.78,2017-06-20,9.63,22.97,,9.63,22.99","AN201705220596001920,32575,80474380,日盈电子,603286,732286,22019000.00,19818000.00,8000.00,63440.00,7.93,2017-06-15,2017-06-19,2017-06-27,22.97,0.0261,,1825.55,30336200,sh,1000.00,24118100000.00,80000.00,23.99,11.42,0.01,http://topic.eastmoney.com/JSRYDZIPO/,主要从事汽车洗涤系统产品、汽车精密注塑件及小线束、汽车电子传感器等汽车零部件及摩托车线束等摩托车零部件的研发、生产和销售。,6.39,,,7.92,19.77,4732,6.39,0.80,5.11,8.00,开板,267.59,10,0.07,2017/7/11 0:00:00,AN201705150581014251,18.52,18.52,2017-06-19,7.93,22.97,,7.93,22.99","AN201706140645308895,32770,80198775,广州酒家,603043,732043,50000000.00,45000000.00,15000.00,197700.00,13.18,2017-06-15,2017-06-19,2017-06-27,20.28,0.0408,,1635.04,32283500,sh,1000.00,57226500000.00,150000.00,21.26,18.98,0.02,http://topic.eastmoney.com/jjjt/,食品制造业务及餐饮业务&sbquo;并以食品制造业务为主。,13.18,,,13.18,32.19,5714,13.18,1.50,19.77,15.00,开板,103.87,4,0.04,2017/7/3 0:00:00,AN201706060629084202,20.19,32.19,2017-06-19,13.18,20.19,,15.00,22.99","AN201706120642875936,32826,80491313,京泉华,002885,002885,20000000.00,20000000.00,20000.00,310600.00,15.53,2017-06-15,2017-06-19,2017-06-27,22.61,0.0136,,,57155300,zxb,500.00,,200000.00,35.26,22.36,0.01,http://topic.eastmoney.com/JQHKJIPO/,主要从事磁性元器件、电源及特种变压器研发、生产及销售业务。,15.53,,,,45.66,,15.53,2,31.06,20.00,开板,204.83,8,0.03,2017/7/7 0:00:00,,22.61,45.66,2017-06-19,15.53,22.61,,15.78,22.99","AN201706110642002605,32811,80399351,沃特股份,002886,002886,19608000.00,19608000.00,19000.00,251560.00,13.24,2017-06-14,2017-06-16,2017-06-27,22.99,0.0139,,,47498900,zxb,500.00,,190000.00,30.54,19.07,0.01,http://topic.eastmoney.com/SZSWTXCL/,主要从事改性工程塑料合金、改性通用塑料以及高性能功能性高分子材料的研发、生产、销售和技术服务,13.23,,,,37.5,,13.23,1.95,25.80,19.50,开板,187.08,9,0.03,2017/7/13 0:00:00,,22.98,37.50,2017-06-16,13.23,22.98,,13.23,22.99","AN201705220596001841,32593,80000206,浙商证券,601878,780878,333333400.00,300001000.00,100000.00,845000.00,8.45,2017-06-13,2017-06-15,2017-06-26,22.98,0.1350,,572.32,6261400,sh,1000.00,133542500000.00,1000000.00,16.55,12.17,0.06,http://topic.eastmoney.com/ZSZQ2014/,经纪业务、投资银行业务、资产管理业务、期货业务和融资融券等证券信用交易业务等,,,,8.18,18.39,5779,,10,,100.00,开板,91.36,3,0.12,2017/6/29 0:00:00,AN201705150581743770,,22.49,2017-06-15,,,,8.45,22.99"]},
    param: { "mk_type": { cname: "li", type: "stat", value: "1"} },
    afterdisplay:function(_t){setTimeout(function(){
        if(_t.tools.browser.ie){
            scrollTable = document.getElementById("dt_1-scroll-table");
            if(scrollTable)
                scrollTable.style.width="auto";
        }
        lcolor();
    },500)
    },minWidth:1200,autoWidit:true,
    maketr: function (row, data, i, c) {
        var _class = (i % 2 == 0) ? "" : "odd";
        var nowtime=new Date();
        _class += (nowtime.format("yyyy-MM-dd") == data[11] ? " today" : "");
        _class += (nowtime.format("yyyy-MM-dd") == data[13] ? " today_1" : "");
        _class += (new Date(nowtime.getTime() + 24 * 60 * 60 * 1000).format("yyyy-MM-dd")== data[13] ? " today_2" : "");
        var mkt=(data[19]=="sh"?"sh":"sz");
        row.className = _class;
        row.onmouseover = function () {
            this.className = "over";
        }
        row.onmouseout = function (o, _c) {
            o.className = _c;
        } .bind(this, row, _class)
        _sgrq = (data[11] == "" || data[11] == "NULL") ? "<span title=\"" + data[11] + "\" class=\"red txt\">"+data[49]+ "</span>" : "<span title=\"" + data[11] + "\" class=\"txt\">" + new Date(Date.parse(data[11].replace(/-/ig, "/"))).format("MM-dd CW") + "</span>",
            //_sgrq = (data[11] == "" || data[11] == "NULL") ? "" : "<span title=\"" + data[11] + "\" class=\"txt\">" + new Date(Date.parse(data[11].replace(/-/ig, "/"))).format("MM-dd CW") + "</span>",
            _zqgbr = (data[12] == "" || data[12] == "NULL") ? "&nbsp;" : Date.parse(nowtime)>(new Date(data[12].replace(/-/ig, "/"))).getTime()?"<a href=\"/xg/xg/detail/" + data[4] + ".html?tr_zqh=1\" class=\"zqh_a\"><span title=\"" + data[12] + "\" class=\"txt\">" + new Date(Date.parse(data[12].replace(/-/ig, "/"))).format("MM-dd") + "</span>&gt;&gt;</a>":"<span title=\"" + data[12] + "\" class=\"txt\">" + new Date(Date.parse(data[12].replace(/-/ig, "/"))).format("MM-dd") + "</span>",
            _ssrq = (data[13] == "" || data[13] == "NULL") ? "&nbsp;" : "<span title=\"" + data[13] + "\" class=\"txt\">" + new Date(Date.parse(data[13].replace(/-/ig, "/"))).format("MM-dd") + "</span>";
        var issgh=(data[11] == "" || data[11] == "NULL")?true:new Date(Date.parse(data[11].replace(/-/ig, "/")))>nowtime;
        var _style_pf = "";
        var _zxj = (data[23] == "-" || data[23] == "" || data[23] == "NULL") ? "&nbsp;" : data[23];
        if (data[23] == '1') {
            _zxj = '<i class="pf" title="破发&#13;注：只判断上市三个月内的新股，如果最新价小于发行价，则判断为破发"></i>' + '<span title="破发&#13;注：只判断上市三个月内的新股，如果最新价小于发行价，则判断为破发">' + _zxj + '</span>';
            _style_pf = "position:relative;display:block;";
        }
        else {
            _zxj =  _zxj ;
        }
        row.cells[14].style.whiteSpace="nowrap";
        if(this.tools.browser.ie6){
            row.cells[13].style.width="60px";
            row.cells[14].style.width="33px";
            row.cells[15].style.width="33px";
            row.cells[19].style.width="33px";
            row.cells[21].style.width="30px";
        }
        else{
            row.cells[13].style.minWidth="33px";
            row.cells[14].style.minWidth="33px";
            row.cells[15].style.minWidth="33px";
            row.cells[19].style.minWidth="33px";
            row.cells[21].style.minWidth="30px";
        }
        var _cetitle = '';
        var _cergbs = (data[17] == "-" || data[17] == "" || data[17] == "NULL") ? "&nbsp;" : data[17];
        var _pdf = data[0] == "" ? (data[43]==""?"&nbsp;":"<a href=\"http://pdf.dfcfw.com/pdf/H2_" + data[43] + "_1.pdf\"><img src=\"/images/pdf.png\" /></a>") : "<a href=\"http://pdf.dfcfw.com/pdf/H2_" + data[0] + "_1.pdf\"><img src=\"/images/pdf.png\" /></a>";
        row.cells[0].innerHTML = "&nbsp;<a href=\"http://quote.eastmoney.com/"+mkt+data[4]+".html\">"+data[4]+"</a>";//股票代码
        row.cells[1].innerHTML = "<a href=\"http://quote.eastmoney.com/"+mkt+data[4]+".html\">"+data[3]+"</a>"; //股票简称
        var detalUrl=(data[11] == "" || data[11] == "NULL") ? '<span style="color: #808080;font-weight: initial;">详细</span>' : '<a href="/xg/xg/detail/' + data[4] + '.html" class="red">详细</a>';
        row.cells[2].innerHTML = '<font class="ssp2">'+detalUrl+' <a href="http://data.eastmoney.com/report/' + data[4] + '.html">研报</a></font> <font class="ssp2"><a href="http://guba.eastmoney.com/topic,' + data[4] + '.html">股吧</a> ' + (data[26].indexOf("http") == -1 ? '<label>专题</label>' : '<a href="' + data[26] + '">专题</a>') + '</font>'; //相关资料
        row.cells[3].innerHTML = ((data[5] == "-" || data[5] == "" || data[5] == "NULL") ? "&nbsp;" : data[5]); //申购代码
        row.cells[4].innerHTML = ((data[6] == "-" || data[6] == "" || data[6] == "NULL") ? "&nbsp;" : (data[6] / 10000).toFixed(0)); //发行总数(万股)
        row.cells[5].innerHTML = (data[7] == "-" || data[7] == "" || data[7] == "NULL") ? "&nbsp;" : (data[7] / 10000).toFixed(0); //网上发行(万股)
        //row.cells[6].innerHTML = (data[37] == "-" || data[37] == "" || data[37] == "NULL") ? "&nbsp;" : (data[37] / 1).toFixed(2); //顶格申购所需市值(万元)
        row.cells[6].innerHTML = isNaN(parseFloat(data[22])) ? ((isNaN(parseFloat(data[37]))||!issgh)?'&nbsp;':('<img src="/images/xg_yugu.png" title="黑色斜体部分为预估值，顶格申购所需市值的预估不涉及公司基本面分析，请谨慎参考。" /><font class="ssp1"  style="font-style:italic;">&nbsp;'+(data[37]/1).toFixed(2))+'</font>') : parseFloat(data[22] / 10000).toFixed(2); //顶格申购所需市值(万元)
        row.cells[7].innerHTML = isNaN(parseFloat(data[8])) ? ((isNaN(parseFloat(data[35]))||!issgh)?'&nbsp;':('<img src="/images/xg_yugu.png" title="黑色斜体部分为预估值，申购上限的预估不涉及公司基本面分析，请谨慎参考。" /><font class="ssp1"  style="font-style:italic;">&nbsp;'+(data[35]/1).toFixed(2))+'</font>') : parseFloat(data[8] / 10000).toFixed(2); //申购上限(万股)
        //row.cells[7].innerHTML = isNaN(parseFloat(data[9])) ? ((isNaN(parseFloat(data[36]))||!issgh)?'&nbsp;':('<img src="/images/xg_yugu.png" title="黑色斜体部分为预估值，申购资金上限的预估不涉及公司基本面分析，请谨慎参考。" /><font class="ssp1"  style="font-style:italic;">&nbsp;'+(data[36]/1).toFixed(2))+'</font>') : parseFloat(data[9] / 10000).toFixed(5).replace(/(0$)/g,"").replace(/(0$)/g,"").replace(/(0$)/g,""); //申购资金上限(万元)
        var isYcj=true;
        var isOneYcj=true;
        //行业市盈率
        var hysyl= (data[32] == "-" || data[32] == ""|| data[32] == "0" || data[32] == "NULL") ?((data[45] == "-" || data[45] == ""|| data[45] == "0" || data[45] == "NULL") ? "&nbsp;" : data[45]) : data[32];
        //预测行业市盈率2
        pe2=pe2*1;
        hysyl=hysyl*1;
        var pe2=!isNaN(parseFloat(data[48]))?data[48]:0;
        row.cells[8].innerHTML =isNaN(parseFloat(data[10])) ? ((isNaN(parseFloat(data[34]))||!issgh)?'&nbsp;':('<img class="Vertical" src="/images/xg_yugu.png" title="黑色斜体部分为预估值，预估值会因为募集资金、发行数量、发行费用等数据变动而变动，仅供参考。" /><font  class="ssp1 Vertical" style="font-style:italic;">&nbsp;'+(data[34]/1).toFixed(2))+'</font>') : (isYcj=false,'<span>'+data[10]+'</span>'); //发行价格
        var cells815=[];
        if((data[34]*1)==(data[47]*1)&&(data[47]*1)==(data[50]*1)&&(data[50]*1)==(data[34]*1))
            isOneYcj=true;
        if(isYcj&&!isNaN(parseFloat(data[34]))&&parseFloat(data[47])!=parseFloat(data[34]))
        {
            isOneYcj=false;
            var idTwo=(isNaN(parseFloat(data[47])));//是否有预测二
            var fxj_x=row.cells[8].innerHTML;
            if(pe2>hysyl)
            {
                //出现预测三的情况:Pe2大于23 ，有预测市盈率2，预测市盈率1不等于预测市盈率3
                if(pe2>23 && !idTwo && parseFloat(data[51])!=parseFloat(data[44]))
                    var top23=true;
                var tishi= GetTiShi(data[34],data[47],data[50],data[44],data[48],data[51],hysyl,data[3]);
                fxj_x = ((isNaN(parseFloat(data[34]))||!issgh)?'':'<p><img class="Vertical" src="/images/xg_yugu'+(idTwo?"":"1")+'.png" title="黑色斜体部分为预估值，预估值会因为募集资金、发行数量、发行费用等数据变动而变动，仅供参考。" /><font  class="ssp1 Vertical" style="font-style:italic;">&nbsp;'+(data[34]/1).toFixed(2)+'</font>&nbsp;<i style="width: 14px;display: inline-block;"></i></p>'+((idTwo)?'':'<p><img class="Vertical" src="/images/xg_yugu'+(idTwo?"":"2")+'.png" title="黑色斜体部分为预估值，预估值会因为募集资金、发行数量、发行费用等数据变动而变动，仅供参考。" /><font  class="ssp1 Vertical" style="font-style:italic;">&nbsp;'+(data[47]/1).toFixed(2)+'</font>'+(top23?'&nbsp;<i style="width: 14px;display: inline-block;"></i>':'&nbsp;<img class="Vertical" src="/images/B3DB94.png" title="'+tishi+'"/>')+'</p>'));
                if(top23)
                {
                    fxj_x += '<p><img class="Vertical" src="/images/xg_yugu3.png" title="黑色斜体部分为预估值，预估值会因为募集资金、发行数量、发行费用等数据变动而变动，仅供参考。"><font class="ssp1 Vertical" style="font-style:italic;">&nbsp;'+(data[50]/1).toFixed(2)+'</font>&nbsp;<img class="Vertical" src="/images/B3DB94.png" title="'+tishi+'"/></p>';
                }
            }
            cells815=GetPAndPe((data[34]*1),(data[47]*1),(data[50]*1),(data[44]*1),(data[48]*1),(data[51]*1),hysyl,data[3],issgh);
            row.cells[8].innerHTML =cells815[0];

            //row.cells[8].innerHTML =((isNaN(parseFloat(data[34]))||!issgh)?'':'<p><img class="Vertical" src="/images/xg_yugu'+(idTwo?"":"1")+'.png" title="黑色斜体部分为预估值，预估值会因为募集资金、发行数量、发行费用等数据变动而变动，仅供参考。" /><font  class="ssp1 Vertical" style="font-style:italic;">&nbsp;'+(data[34]/1).toFixed(2)+'</font>'+(baseArr[data[4]]?'&nbsp;<i style="width: 14px;display: inline-block;"></i>':"")+'</p>'+((idTwo)?'':'<p><img class="Vertical" src="/images/xg_yugu'+(idTwo?"":"2")+'.png" title="黑色斜体部分为预估值，预估值会因为募集资金、发行数量、发行费用等数据变动而变动，仅供参考。" /><font  class="ssp1 Vertical" style="font-style:italic;">&nbsp;'+(data[47]/1).toFixed(2)+'</font>'+(baseArr[data[4]]?'&nbsp;<img class="Vertical" src="/images/B3DB94.png" title="'+baseArr[data[4]]+'"/>':'')+'</p>'));

            //使用预测
            //row.cells[8].innerHTML =((isNaN(parseFloat(data[34]))||!issgh)?'&nbsp;':('<p><img class="Vertical" src="/images/xg_yugu1.png" title="黑色斜体部分为预估值，预估值会因为募集资金、发行数量、发行费用等数据变动而变动，仅供参考。" /><font  class="ssp1 Vertical" style="font-style:italic;">&nbsp;'+(data[34]/1).toFixed(2))+'</font></p>'+((isNaN(parseFloat(data[49])))?'':'<p><img class="Vertical" src="/images/xg_yugu2.png" title="黑色斜体部分为预估值，预估值会因为募集资金、发行数量、发行费用等数据变动而变动，仅供参考。" /><font  class="ssp1 Vertical" style="font-style:italic;">&nbsp;'+(data[28]/1).toFixed(2)+'</font>&nbsp;</p>')); //发行价格
            //if(baseArr[data[4]])
            //{
            //    row.cells[8].innerHTML =((isNaN(parseFloat(data[34]))||!issgh)?'&nbsp;':('<p><img class="Vertical" src="/images/xg_yugu1.png" title="黑色斜体部分为预估值，预估值会因为募集资金、发行数量、发行费用等数据变动而变动，仅供参考。" /><font  class="ssp1 Vertical" style="font-style:italic;">&nbsp;'+(data[34]/1).toFixed(2))+'</font>&nbsp;<i style="width: 14px;display: inline-block;"></i></p>'+((isNaN(parseFloat(data[49])))?'':'<p><img class="Vertical" src="/images/xg_yugu2.png" title="黑色斜体部分为预估值，预估值会因为募集资金、发行数量、发行费用等数据变动而变动，仅供参考。" /><font  class="ssp1 Vertical" style="font-style:italic;">&nbsp;'+(data[49]/1).toFixed(2)+'</font>&nbsp;<img class="Vertical" src="/images/B3DB94.png" title="'+baseArr[data[4].trim()]+'"/></p>')); //发行价格
            //}
        }
        //临时处理，601878没有发行价时，写死两个预估价
        if(data[4] == "601878" && isNaN(parseFloat(data[10]))){
            row.cells[8].innerHTML = '<p><img title="黑色斜体部分为预估值，预估值会因为募集资金、发行数量、发行费用等数据变动而变动，仅供参考。" src="/images/xg_yugu1.png" class="Vertical"><font style="font-style:italic;" class="ssp1 Vertical">&nbsp;8.45</font>&nbsp;</p><p><img title="黑色斜体部分为预估值，预估值会因为募集资金、发行数量、发行费用等数据变动而变动，仅供参考。" src="/images/xg_yugu2.png" class="Vertical"><font style="font-style:italic;" class="ssp1 Vertical">&nbsp;6.57</font>&nbsp;</p>';
        }
        row.cells[9].innerHTML = _zxj; //最新价
        row.cells[9].setAttribute('style', _style_pf);
        row.cells[10].innerHTML = isNaN(parseFloat(data[24])) ? data[24] + "&nbsp;" : data[24]; //首日收盘价
        row.cells[11].innerHTML = _sgrq;//申购日期
        row.cells[12].innerHTML = '<font  class="ssp3">'+_zqgbr+'</font>';//中签号公布日期
        //中签缴款日期
        var _sjkrq =(data[46] == "" || data[46] == "NULL") ? "&nbsp;" : "<span title=\"" + data[46] + "\" class=\"txt\">" + new Date(Date.parse(data[46].replace(/-/ig, "/"))).format("MM-dd") + "</span>";

        row.cells[13].innerHTML = _sjkrq;
        row.cells[14].innerHTML = '<font  class="ssp3">'+_ssrq+'</font>'; //上市日期
        var isYcsyl=true;
        row.cells[15].innerHTML =isNaN(parseFloat(data[14])) ? ((isNaN(parseFloat(data[44]))||!issgh)?'&nbsp;':('<img src="/images/xg_yugu.png" title="黑色斜体部分为预估值，发行市盈率的预估不涉及公司基本面分析，请谨慎参考。" /><font  class="ssp1" style="font-style:italic;">&nbsp;'+(data[44]/1).toFixed(2))+'</font>') :(isYcsyl=false,''+ data[14]+''); //发行市盈率
        if(isYcsyl&&!isNaN(parseFloat(data[48]))&&parseFloat(data[44])!=parseFloat(data[48]))
        {
            if(isOneYcj){
                row.cells[15].innerHTML='<p><img src="/images/xg_yugu.png" title="黑色斜体部分为预估值，发行市盈率的预估不涉及公司基本面分析，请谨慎参考。"><font class="ssp1" style="font-style:italic;">&nbsp;'+(data[48]/1).toFixed(2)+'</font></p>';
            }else {
                if(pe2>hysyl)
                {
                    var syl_x=((isNaN(parseFloat(data[44]))||!issgh)?'&nbsp;':('<p><img src="/images/xg_yugu1.png" title="黑色斜体部分为预估值，发行市盈率的预估不涉及公司基本面分析，请谨慎参考。" /><font  class="ssp1" style="font-style:italic;">&nbsp;'+(data[44]/1).toFixed(2)+'</font></p><p><img src="/images/xg_yugu2.png" title="黑色斜体部分为预估值，发行市盈率的预估不涉及公司基本面分析，请谨慎参考。" /><font  class="ssp1" style="font-style:italic;">&nbsp;'+(data[48]/1).toFixed(2)+'</font></p>'));
                    if(pe2>23&&parseFloat(data[44])!=parseFloat(data[51]))
                    {
                        syl_x+='<p><img src="/images/xg_yugu3.png" title="黑色斜体部分为预估值，发行市盈率的预估不涉及公司基本面分析，请谨慎参考。"><font class="ssp1" style="font-style:italic;">&nbsp;'+(data[51]/1).toFixed(2)+'</font></p>';
                    }
                    //row.cells[15].innerHTML=GetPAndPe((data[34]*1),(data[47]*1),(data[50]*1),(data[44]*1),(data[48]*1),(data[51]*1),hysyl,data[3],issgh)[1];
                }
                row.cells[15].innerHTML=cells815[1];
            }
        }
        row.cells[16].innerHTML = (data[32] == "-" || data[32] == ""|| data[32] == "0" || data[32] == "NULL") ?((data[45] == "-" || data[45] == ""|| data[45] == "0" || data[45] == "NULL") ? "&nbsp;" : data[45]) : data[32]; //行业市盈率

        row.cells[17].innerHTML = (data[15] == "-" || data[15] == "" || data[15] == "NULL") ? "&nbsp;" : data[15]; //中签率（%）
        //row.cells[18].innerHTML = (data[18] == "-" || data[18] == "" || data[18] == "NULL") ? "&nbsp;" : (data[18] / 10000).toFixed(0); //每中一签约(万元)
        //row.cells[19].innerHTML = (data[16] == "-" || data[16] == "" || data[16] == "NULL") ? "&nbsp;" : (data[16] / 100000000).toFixed(0); //冻结资金（亿元）
        row.cells[18].innerHTML = _cergbs; //询价累计报价倍数
        row.cells[19].innerHTML = (data[33] == "")?"&nbsp;":data[33]; //配售对象报价家数
        //row.cells[22].innerHTML = (data[41] == "-" || data[41] == "" || data[41] == "NULL") ? "&nbsp;" : data[41]; //打新收益(%)
        row.cells[20].innerHTML = (data[40] == "")?data[38]:("<a href=\"http://quote.eastmoney.com/"+mkt+data[4]+".html\">"+data[40]+"</a>"); //连续<br/>一字板<br />数量
        var zzf = data[39], fZxj = parseFloat(_zxj), fFxj = parseFloat(data[10]);
        if(data[38] == "未开板" && !isNaN(fZxj) && !isNaN(fZxj) && fFxj != 0)
            zzf = ((fZxj - fFxj) / fFxj * 100).toFixed(2);
        row.cells[21].innerHTML = zzf; //总涨幅

        //沪市：每中一签获利=1000*发行价格*总涨幅%，四舍五入取整数
        //深市：每中一签获利=500*发行价格*总涨幅%。
        var mzyq;

        if(!isNaN(fFxj)&&!isNaN(zzf)&&fFxj!=0&&zzf!=0)
        {
            mzyq= mkt=="sz"? Math.round(500*fFxj*zzf/100):Math.round(1000*fFxj*zzf/100);
        }
        else
        {
            mzyq="";
        }

        row.cells[22].innerHTML =mzyq;//每中一签获利（元）
        row.cells[23].innerHTML = _pdf; //招股说明书
        row.setAttribute('title', data[27].replace(/&sbquo;/ig, ",").replace(/&quot;/ig, "\""));
    }
});


//老

var wwwwwwidth;
if (window.innerWidth) wwwwwwidth = window.innerWidth;
else if ((document.body) && (document.body.clientWidth)) wwwwwwidth = document.body.clientWidth;
if (document.documentElement && document.documentElement.clientHeight && document.documentElement.clientWidth) {
    wwwwwwidth = document.documentElement.clientWidth
}
if(wwwwwwidth<1200){
    document.getElementById("mainflow").style.width = "100%";
}
//a 基础数据，
//b 类型“%”百分数 “w”大写 (X万||X亿)
//c 可选参数，如存在则根据其确定红绿展示不存在则根据a展示红绿
function getcolor_JS(a, b, c) {
    if (a == '-'||a==""||a=="NaN") return "<span>-</span>";
    var v;
    if (b == "%") v = parseFloat(a).toFixed(2) + b;
    else if (b == "w") {
        var m = Math.abs(a);
        if (m < 10000) {
            v = (a/1).toFixed(0);
        } else if (m >= 10000 && m < 1000000) {
            v = (a / 10000).toFixed(2) + "万";
        } else if (m >= 1000000 && m < 100000000) {
            v = (a / 10000).toFixed(0) + "万";
        } else if (m >= 100000000 && m < 10000000000) {
            v = (a / 100000000).toFixed(2) + "亿";
        } else {
            v = (a / 100000000).toFixed(0) + "亿";
        }
    } else v = (a * 100 / 100).toFixed(2);
    if (c) a = c;
    if (a.length > 0) {
        if (a.substring(0, 1) == '-') return "<span class=\"green\">" + v + "</span>";
        else if (a != 0) return "<span class=\"red\">" + v + "</span>";
    }
    return "<span>" + v + "</span>";
}